/* eslint-disable jsx-a11y/label-has-associated-control */

import React, { useState, useRef, useEffect } from 'react';
import PropTypes from 'prop-types';

const AgreementPopup = ({ onAccept }) => {
  const [isChecked, setIsChecked] = useState(false);
  const [step, setStep] = useState(1);

  const contentRef = useRef(null);

  useEffect(() => {
    if (step === 2 && contentRef.current) {
      contentRef.current.scrollTo({ top: 0, behavior: 'smooth' });
    }
  }, [step]);

  const handleAccept = () => {
    if (isChecked) {
      if (step === 1) {
        setStep(2);
        setIsChecked(false);
      } else {
        onAccept();
      }
    }
  };

  return (
    <div className="fixed inset-0 bg-black bg-opacity-50 flex items-center justify-center z-50">
      <div className="bg-white p-6 rounded-lg shadow-lg w-96 h-400 flex flex-col">
        <h2 className="text-lg font-bold mb-4 text-center">موافقت نامه</h2>
        <div
          ref={contentRef} 
          className="flex-grow overflow-y-auto mb-4 h-80 scrollbar-thin scrollbar-thumb-gray-500 scrollbar-track-gray-300"
        >
          {step === 1 ? (
                       <div className="text-sm flex flex-col mb-4 h-80">
                       <h className="text-base text-center font-bold">قوانین سرمایه گذاری</h>
                       -به منظور استفاده از سکو و سرمایه گذاری در طرح ها لازم است تا هر فرد سرمایه گذار دارای
                       حساب کاربری در سکو باشد و کلیه اطلاعات مورد نیاز برای احراز هویت خودرا در قالب فرم های
                       سامانه تکمیل یا بارگذاری کند ثبت نام و عضویت در پلتفرم به منزله پذیرش کلیه قوانین و ریسک
                       های مربوط به سرمایه گذاری می باشد. -تمامی اطلاعات سرمایه گذاران نزد سکو محفوظ و محرمانه
                       تلقی می شود. -سود حاصل از سرمایه گذاری در طرح ها معاف از مالیات است. -واریز و برداشت وجه
                       از کیف پول شما در سایت تامین مالی جمعی از طریق درگاههای پرداخت معتبر داخلی و دارای مجوز
                       انجام می شود. -سرمایه گذار در قبال سرمایه گذاری در هر طرح گواهی مشارکت از فرابورس دریافت
                       می نماید. -تمامی سرمایه گذاران موظف به دریافت کدبورسی می باشند. -سرمایه گذار به هیچ
                       عنوان امکان لغو مشارکت خود در طرح ها را ندارد. -برای پرداخت انلاین باید از کارت بانکی
                       متعلق به خودتان استفاده کنید. -بازپرداخت هرگونه وجهی از طرف سکو به کاربران منحصرا به
                       حساب بانکی متعلق به خود انها انجام می شود -حداقل مبلغ سرمایه گذاری یک میلیون تومان
                       وحداکثر مبلغ سرمایه گذاری برای اشخاص حقیقی تا 5%کل مبلغ پروژه می باشد برای سرمایه گذاران
                       حقوقی هیچگونه محدودیتی وجود ندارد. -در تعداد طرح های انتخابی برای سرمایه گذاری هیچ گونه
                       محدودیتی برای اشخاص حقیقی و حقوقی وجود ندارد. -در تامین مالی جمعی منابع مورد نیاز برای
                       راه اندازی یا توسعه یک کسب و کار تامین می شودو سرمایه گذار نقش مشارکت کننده در طرح را
                       داشته و در سود و زیان طرح شریک است. -سرمایه گذارانی که در خارج از کشور حضور دارند نیز می
                       توانند در جمع اوری منابع مورد نیاز طرح ها شرکت داشته باشند. -سرمایه گذاران باید بیانیه
                       هشدار ریسک و قوانین مربوطه را مطالعه نموده و هربار قبل از سرمایه گذاری در فرصت های موجود
                       بیانیه ریسک را به صورت دیجیتالی تایید کنند. -تایید مطالعه قرارداد و واریز وجه به منزله
                       امضا و عقد قرارداد از جانب سرمایه گذار می باشد. -کارمزد خدمات ارایه شده در سکو برعهده
                       متقاضی سرمایه بوده و عملا این خدمات برای سرمایه گذاران رایگان می باشد.
                     </div>
          ) : (
            <div className="text-sm flex flex-col mb-4 h-80">
                         <h className="text-base text-wrap text-center font-bold">اقرارنامه و بیانیه پذیرش ریسک سرمایه گذاری در تامین مالی جمعی</h>
                         تامین مالی جمعی به عنوان روشی برای سرمایه گذاری مشابه سایر روش ها متضمن ریسک هایی برای
                         تامین کننده سکوی تامین مالی جمعی ایساتیس کراد به عنوان عامل مجاز برخی از خطرات این
                         سرمایه گذاری را در اجرای مواد ۲۹ و ۳۰ دستور العمل تامین مالی جمعی به شرح زیر به اطلاع
                         تامین کنندگان محترم می رساند: 1- در تامین مالی جمعی متقاضی با استفاده از وجوه اقدام به
                         راه اندازی و توسعه کسب و کار اقتصادی برای تحصیل سود می نماید اما سودآوری طرح قطعی نیست
                         علاوه بر این از آنجا که متقاضیان و تامین کنندگان مستند به ماده ۲ «دستور العمل تامین مالی
                         جمعی» در سود و زبان طرح ها شریک هستند در صورت شکست یا انحراف طرح احتمال ضرر یا از بین
                         رفتن سرمایه تامین کننده وجود دارد. ضمناً در صورت انحراف برنامه کسب و کار متقاضی از
                         برنامه پیش بینی شده و نکول متقاضی در پرداخت عامل در راستای حفظ منافع تامین کنندگان و در
                         چارچوب قراردادهای مربوط اقدامات مقتضی را انجام میدهد. 2- با توجه به نبود ضامن نقد شوندگی
                         طی دوره تا سررسید دسترسی به وجه سرمایه گذاری شده پیش از موعد سررسید و نقل و انتقال گواهی
                         شراکت آن جز در صورت تجویز مقررات و با رعایت کلیه الزامات آنها وجود نخواهد داشت. 3- عامل
                         در محدوده قوانین مقررات و توافقات فی مابین مسئول بررسی صحت اسناد و مدارک و ارائه خدمات
                         مربوط به تامین مالی جمعی است. به همین دلیل در راستای اجرای ماده ۳۲ دستورالعمل تامین مالی
                         جمعی عامل توصیه به سرمایه گذاری در هیچ طرح خاصی نخواهد کرد همچنین معرفی یا انتشار
                         فراخوان طرح بدون اخذ نماد اختصاصی از فرابورس یا انجام اقدامات مربوط برای تامین مالی جمعی
                         خارج از سکو ممنوع و بلااثر میباشد. 4- تامین مالی جمعی در بستر قوانین و مقررات مربوط
                         انجام شده و کلیه ذی نفعان ملزم به اطلاع و رعایت آنها هستند. تغییرات قوانین و مقررات باقی
                         علم و آگاهی سرمایه گذاران نسبت به آنها نبوده و نظارت کارگروه ارزیابی تامین مالی جمعی بر
                         فرایند مربوط سلبب مسئولیت تامین کنندگان در کسب آگاهی های مربوط و تعهد آنها به پذیرش
                         ریسکهای مطرح در سرمایه گذاری نخواهد بود. 5- اعطای مجوز فعالیت به عامل توسط کارگروه
                         ارزیابی تامین مالی جمعی و فرابورس ایران به منظور حصول اطمینان از رعایت قوانین و مقررات و
                         شفافیت اطلاعاتی است. اعطای این مجوزها به معنی نظارت تمام عیار بر تمامی متقاضیان و تامین
                         کنندگان یا تایید مزایا و تضمین سودآوری فعالیت های آنها نبوده و هیچ یک از مجوزهای اعطا
                         شده توسط فرابورس ایران مبنی بر تایید طرحی خاص یا توصیه به سرمایه گذاری در آن نیست
                         کارگروه ارزیابی تامین مالی جمعی و فرابورس ایران در خصوص ضرر و زیان ناشی از اتکا به تمام
                         یا بخشی از مندرجات اسناد و مدارک مربوط از خود سلب مسئولیت می نماید. 6- اعلام ریسک های
                         فوق به معنی سلب مسئولیت از عامل نبوده و از آنجا که عامل با اطلاع از قوانین و مقررات
                         مربوط در حدود تکالیف مقرراتی قراردادی و حرفه ای خود اقدام به فعالیت مینماید در صورت قصور
                         یا تقصیر از تکالیف مذکور حسب مورد از حیث مدنی، کیفری یا انضباطی مسئول خواهد بود به هر
                         ترتیب سرمایه گذاران میتوانند در صورت مشاهده هر گونه تخلف از مقررات حاکم بر تامین مالی
                         جمعی مراتب را با فرابورس ایران مکاتبه نمایند. به موجب این سند این جانب/ این
                         شرکت.....................اقرارنامه و بیانیه ریسک سرمایه گذاری در تامین مالی جمعی را
                         دریافت و مطالعه نموده و ضمن اعلام اطلاع از کلیه قوانین مقررات و خصوصیات این گونه از
                         سرمایه گذاری و ریسکهایی که در آن منصور میباشد از جمله و نه محدود به ریسکهای مورد اشاره
                         در این سند مراتب را تایید نموده و با علم به آنها در این زمینه فعالیت مینماید.
                       </div>
          )}
        </div>
        <div className="mt-4">
          <div className="flex items-center mb-4">
            <label className="text-sm">موافقم</label>
            <input
              type="checkbox"
              id="agree"
              checked={isChecked}
              onChange={() => setIsChecked(!isChecked)}
              className="mr-2"
            />
          </div>
          <button
            type="button"
            onClick={handleAccept}
            className={`w-full py-2 px-4 rounded ${
              isChecked
                ? 'bg-blue-500 hover:bg-blue-700 text-white'
                : 'bg-gray-300 text-gray-600 cursor-not-allowed'
            }`}
            disabled={!isChecked}
          >
            {step === 1 ? 'تأیید و مرحله بعد' : 'تأیید و بستن'}
          </button>
        </div>
      </div>
    </div>
  );
};

AgreementPopup.propTypes = {
  onAccept: PropTypes.func.isRequired,
};

export default AgreementPopup;
